# vsoContextM_GetItem

## Description
Get selected object context menu item during ObjectContextMenuEvent::kAction_Event event.

```pascal
FUNCTION vsoContextM_GetItem : INTEGER;
```

```python

def vs.vsoContextM_GetItem():
    return INTEGER
```

## Version
Availability: from Vectorworks 2014
## Category
* Object Events